# pip install pymysql 터미널 설치
# SQL의 정의 및 개념
# 목적: SQL은 데이터베이스와 소통하기 위해 사용되는 표준 프로그래밍 언어입니다. 관계형 데이터베이스 등 다양한 종류의 데이터베이스에서 데이터를 관리하고 조작하는 데 필수적입니다.
# 기능: SQL을 통해 데이터 조회, 데이터 업데이트, 새로운 데이터 삽입, 데이터베이스에서 데이터 삭제 등의 작업을 수행할 수 있습니다.

# 사용 분야
# 데이터 관리: 금융, 의료, 전자상거래 등 대량의 데이터를 관리해야 하는 산업에서 중요합니다.
# 데이터 분석: 데이터로부터 의미 있는 통찰을 추출하는 데 데이터 분석에서 광범위하게 사용됩니다.
# 웹 개발: 웹 애플리케이션의 백엔드 개발에서 사용자 데이터를 관리하는 데 필수적입니다.
# 데이터 과학: 데이터 과학 프로젝트에서 데이터 조작과 준비를 위해 사용됩니다.

# SQL의 구성 요소
# DDL (Data Definition Language, 데이터 정의 언어):
# 목적: 데이터베이스 및 테이블 구조를 정의하고 수정하는 데 사용됩니다.
# 명령어: CREATE, ALTER, DROP.
# DML (Data Manipulation Language, 데이터 조작 언어):
# 목적: 데이터 삽입, 업데이트, 삭제와 같은 데이터 조작 작업을 수행합니다.
# 명령어: INSERT, UPDATE, DELETE.
# TCL (Transaction Control Language, 트랜잭션 제어 언어):
# 목적: 데이터베이스 내의 트랜잭션을 관리합니다.
# 명령어: COMMIT, ROLLBACK, SAVEPOINT.
